app/Controllers/Admin.php

SELECT *
FROM `user`
WHERE `is_verif` = 1
AND `level` = 'user'
AND `id_user` IS NULL
SELECT *
FROM `user`
WHERE `level` = 'admin'
---
    public function LevelAccess()
    {
        $model = new AdminModel();
        $data['check'] = $model->where('is_verif', 1)->where('level', 'user')->where('id_user')->findAll();
        $data['userlevel'] = $model->where('level', 'admin')->findAll();

SELECT *
FROM `user`
---
    public function DataUser()
    {
        $model = new AdminModel();
        $data['datauser'] = $model->findAll();